let text = `
가죽연마

북의 표면을 <strong>깎아 얇게 만들어 롤을 쉽게 넣거나 반응을 좋게 하는 행위</strong>를 말한다. <em>소라이로 Ver.</em>에서 스킨의 재질이 바뀐 것 같고, 이전보다 더 <span style="font-size: 16px;">두꺼워졌다</span>. 이 때문에 유지보수에 따라 롤을 넣기 힘들어지거나 반응이 느려지는 경우가 있었다. 이른바 기체 개조라고 할 수 있다. 매장에 따라서는 유지보수의 일환으로 하는 경우도 있지만, 플레이어가 <u>무단으로 하면 당연히 기물파손죄에 해당하기 때문에 해서는 안 된다</u>. 꼭 매장 측에서 면취 작업을 해줬으면 하는 경우에는 매장 측에 <span title="요청은 매장 측의 정책에 따라 다를 수 있습니다.">요청</span>해야 하지만, 일반적인 유지보수 방법이 아니기 때문에 처음부터 받아주지 않는 경우가 많다. <s>거절당하면 쿨하게 포기해야 한다</s>. 무단으로 하다 적발되면 당연히 <span style="color: red;">경찰에 신고되므로 절대 해서는 안 된다</span>.

거병
<b>기체를 불량하게 사용하는 비매너 유저.</b> 북의 면이나 테두리, 원래 쳐야 할 곳이 아닌 북의 몸통을 힘껏 두드리는 행위를 주로 가리킨다.

결과 방치
<b>자신의 플레이 결과 발표 화면을 그대로 두고 떠나는 것을 말한다.</b> 주로 마지막 곡의 성적 발표 화면(+각종 보상 획득 연출)을 방치하는 것을 말한다. <b>다음 차례인 사람이 원활하게 게임을 시작하지 못하기 때문에 문제가 되고 있다.</b> 처음부터 끝까지 보지 않은 사람이 '다음 줄에 있던 사람이 연타를 하고 있다'고 오해할 가능성도 있기 때문에, 플레이어 본인이 '끝났다'고 표시될 때까지 화면을 진행해야 한다. 니지이로 Ver.에서는 플레이 중 보상(키세카에, 칭호 등)을 획득하면 해당 곡의 결과 발표 화면에서 각종 보상 획득 연출이 진행된다. 획득 확인이나 (예/아니오 선택)을 하는 화면은 자동으로 다음 단계로 넘어가기까지 시간이 꽤 오래 걸린다.

곡ID
곡의 데이터를 다룰 때 어떤 곡인지 구분하기 위한 별칭 같은 것이다.


결과 방치
자신의 <strong>플레이 결과 발표 화면을 그대로 두고 떠나는 것</strong>을 말한다. 주로 마지막 곡의 성적 발표 화면(<u>+각종 보상 획득 연출</u>)을 방치하는 것을 말한다. 다음 차례인 사람이 <span style="font-size: 16px;">원활하게 게임을 시작하지 못하기 때문에 문제가 되고 있다</span>. 처음부터 끝까지 보지 않은 사람이 '다음 줄에 있던 사람이 연타를 하고 있다'고 <em>오해할 가능성도 있기 때문에</em>, 플레이어 본인이 '끝났다'고 표시될 때까지 화면을 진행해야 한다. <span title="니지이로 Ver.의 특별한 점">니지이로 Ver.</span>에서는 플레이 중 보상(키세카에, 칭호 등)을 획득하면 해당 곡의 결과 발표 화면에서 각종 보상 획득 연출이 진행된다. 획득 확인이나 (예/아니오 선택)을 하는 화면은 자동으로 다음 단계로 넘어가기까지 시간이 꽤 오래 걸린다.


곡 ID
곡의 데이터를 다룰 때 어떤 곡인지 구분하기 위한 <b>별칭</b> 같은 것이다.

교차

기본적으로 어떤 채보라도 좌우로 번갈아 가며 계속 치는 <b>타법</b>이다. <i>버나스</i>와는 달리, 오른손 시작이 아니라 이전에 두드린 팔과 반대쪽 팔부터 두드리는 방식이다. 초반에는 헷갈리지만 <b><i>숙달</i></b>되면 체력 소비를 줄일 수 있고 <u>안정성</u>을 높일 수 있다.

기본채, 오락실 북채

기체에 붙어 있는 채의 속칭. <b>공식적으로는 '기체 부속 채', '게임기 부속 채' 등으로 불린다</b>. 무게는 1쌍당 290g이며, 1P 쪽에는 빨간색 채, 2P 쪽에는 파란색 채이 1쌍(2개)씩 장착되어 있다. <b>일부 매장에서는 어린 아이들을 위해 더 가벼운 채가 달려 있는 경우도 있다</b>. 사고 방지를 위해 미끄럼 방지 고무로 덮여 있고, 케이스와 끈으로 묶여 있는 경우가 많다.

난민

<p>단위도장과 그와 비슷한 시스템이 있는 게임에서 <strong>특정 곡만 계속 클리어하지 못해 해당 등급을 취득하지 못하는 유저들</strong>을 부르는 말이다.</p>

다중

<p>주로 면을 두드리면 오른쪽과 왼쪽 면이 <strong>짧은 간격으로 반응하거나, 이중, 삼중으로 반응하는 것</strong>. 16분노트나 24분노트를 치는 도중에 발생하면 가, 불가가 나오는 경우가 많다. <em>풀콤보나 전량 근처에서 너무 긴장해서 힘껏 치다 보면 의도치 않게 이런 일이 발생할 수 있다.</em> <strong>기체의 감도 설정 등 유지 보수에 영향을 받기도 하므로 플레이할 때 주의가 필요하다.</strong></p>

대표곡

<p><strong>여러 가지 의미를 가진 단어이므로 각각의 의미를 구분해서 적는다.</strong></p>
<ol>
<li>북의 명곡으로 오랫동안 자주 연주되는 경우가 많은, 소위 모두에게 사랑받는 곡. 대부분은 삭제되지 않고 계속 수록되고 있기 때문에 아래의 (2)에도 해당된다. 대표적으로 <span style="font-style: italic;">さいたま2000, エンジェル ドリーム, 夏祭り, 紅, ナイト・オブ・ナイツ</span> 등이 있다.</li>
<li>AC에서 버전업이 반복되어도 삭제되지 않는 노래. (1)에 해당할 정도로 자주 연주되지 않는 곡은 수수하게 남아있다는 인상을 주기 쉽다. 예: <span style="font-style: italic;">カルメン 組曲一番終曲, ソウルキャリバーII, 天体観測</span> 등</li>

대행, 대리

<p><strong>스스로 달성할 수 없는 곡이나 단계를 다른 사람에게 연주하게 하여 달성한 것처럼 속이는 부정행위.</strong> '고수에게 인정받고 싶다.','풀콤보 칭호를 얻고 싶다.'라고 생각하더라도 절대로 다른 사람에게 부탁해 달성, 획득을 대행하게 해서는 안 된다.</p>
<p>대리하는 순간 앞서 말한 대로 부정행위가 되고, 게임 전체의 도덕성 결여로 이어져 <u>성실하게 플레이하는 사람들까지 손가락질 당하게 된다</u>. <span style="font-style: italic;">쓸데없는 허영심은 버려야 한다.</span></p>


도롱 데타

<p><strong>옵션 '도롱'과 '데타라메'를 동시에 사용해 플레이하는 것.</strong> 노트가 아무것도 보이지 않는 데다 노트의 배색도 변경되어 <u>암기에 의한 공략이 불가능해지기 때문에</u>, 노트 아래에 표시되는 '동', '캇' 등의 문자나 마디 선만 믿고 연주해야 하기 때문에 <span style="font-style: italic;">바이데타보다 난이도가 높아지는 옵션의 조합이다.</span></p>

동더

<p><strong>태고의 달인 플레이어.</strong> 일반적으로 넓은 의미로 사용되며, 초보자부터 상급자까지를 통틀어 이렇게 부른다. 원조는 과거 태고의 달인의 공식 사이트 이름이 구 남코의 공식 사이트 'Wonder Page'의 이름을 딴'Donder Page'였던 것에서 유래했다. 현재는 <span style="font-style: italic;">'동더 광장'</span>이라는 명칭과 각종 칭호 등에 사용되고 있는 것처럼 <u>공식적인 용어</u>이다.</p>


로케테
<p><strong>로케이션 테스트</strong> (개발 중인 게임을 일반에 공개하고 유저들에게 직접 의견을 받아 게임 조정을 하는 것)의 줄임말. 로케테스트라고도 한다. '태고의 달인'에서 기체 자체의 로케 테스트는 진행되지 않았지만, 공식적인 '로케 테스트'로 사전 체험회가 열린 것은 <strong>공식 마이바치와 특훈 모드</strong>의 두 가지 사례가 있다.</p>


롤

<p><strong>특수 연타</strong>의 하나. del>리그 오브 레전드 아님</del>.</p>

롤처리

<p>한 번에 두 번 이상 치고, <span style="text-decoration:underline;">24분노트</span>와 같이 간격이 짧은 음을 제대로 치는 것보다 적은 횟수로 치는 방법. 한 번에 여러 번 치는 <span style="text-decoration:underline;">황연타</span>의 치는 방법을 일반 노트에 응용한 것이다. <em>실제 운용을 위해서는 채 한 번으로 정확하게 2타, 3타,...</em>를 치는 기술이 필요하다. 채의 반발력을 이용하는 특성상 정확도가 낮아지는 경향이 있어 전량을 노릴 때는 적합하지 않다.</p>
<p><strong>롤 처리</strong> 등의 간소화가 일반화되면서 간소화를 전혀 하지 않고 노트대로 정확하게 치는 것을 '정공법'이라고 부르게 되었다. 구기판에서는 롤 처리를 통한 콤보 연결이 어려웠고, 애초에 롤 처리를 사용할 수밖에 없는 채보가 존재하지 않았던 역사적 배경 때문에 과거에는 정공법주의가 주류였다.</p>
<p>이후 <em>유현의 난</em> 등 정공법 처리가 어려운 채보가 증가함에 따라, 롤 처리를 실제로 운용하는 동더도 증가하는 추세다.</p>

마이바치

<p><strong>오락실 북채</strong>와 달리 플레이어가 가져와서 사용하는 북채를 말한다. <em>공식적으로 제작 및 판매되는 '공식 마이바치'</em>와 자작 북채나 <span style="text-decoration: underline;">제3자가 판매하는 비공식 북채</span>가 있다.</p>

무반응, 씹힘

<p><strong>북을 두드려도 인식하지 못하는 현상</strong>. 두드리는 힘이 너무 약하거나, <span style="text-decoration: underline;">반응 한계 설정값이 높거나</span>, 북 상태가 안 좋거나, 반응 범위가 어긋나면 발생하기 쉽다.</p>

물렙

<p>공식이 지정한 난이도보다 <em>쉽게 느껴지는 곡</em>을 말한다. 난이도 개정 시 체감 난이도에 맞지 않게 <strong><em>승급한 곡</em></strong>부터 AC6 이전의 난이도 기준을 <u>그대로 유지한 곡</u>까지 다양하다.</p>

뭉게기

<p><strong>KONAMI 'beatmania'</strong>의 플레이어 <em>'안미츠'</em>가 고안한 공략법. 이 게임의 <span style="font-style: italic;">'ska a go go'</span>라는 곡에서 여러 레인으로 쏟아지는 노트를 동시에 눌러서 한꺼번에 끊어낸 것이 계기가 되어 그 유용성으로 인해 다른 음악 게임에도 널리 퍼져나갔다.</p>
<p>좁은 간격으로 연속된 두 음을 한 손으로 면과 가장자리를 동시에 쳐서 끊어내는 타법 (AC나 타타콘에서는 할 수 없으므로 일부 CS에서 컨트롤러를 사용할 때만 가능).</p>
<p>또는 두 개 이상의 연속된 노트에 대해 실제 타이밍보다 간격을 짧게 두드리는 것. 늦게 들어가서 빨리 치는 것(<span style="font-family: monospace;">●__●__●</span>를 <span style="font-family: monospace;">_●_●_●_●_</span>로 치는 것).</p>

바이데타

<p>옵션 <span style="font-weight: bold;">'배속'(×2.0)</span>과 <em>'데타라메'</em>를 동시에 사용해 플레이하는 것을 말한다.</p>

발광

<p>채보에서 <span style="font-weight: bold; color: red;">엄청나게 어려운 부분</span>을 말한다. 채보의 일부분만 <em>미친 듯이 난이도가 올라가기 때문에</em> 이렇게 부르는 경우가 많다. 특히 <span style="text-decoration: underline;">광란의 밀도가 높고</span> 다른 부분이 매우 쉽거나 밀도가 낮은 경우 "<span style="font-style: italic; font-weight: bold;">국소 난</span>"이라고 할 수 있습니다.</p>

버너스

<p>노트(단음)를 <span style="font-weight: bold;">모두 오른손으로 치는 연주법</span>을 말한다. 장점으로는 <span style="color: green;">복합 채보를 쉽게 처리할 수 있고, 복잡한 패턴도 헷갈리지 않아 정확도가 높다는 점</span> 등을 꼽을 수 있다. 하지만 <span style="text-decoration: underline;">체력적으로 힘들고 팔의 속도에도 한계가 있기 때문에</span> BPM이 빠르거나 노트 간격이 짧으면 대처하기 힘들다. <em>개발자는 에히메현 동다의 ヤ～タン☆ヴァ～ナス씨로 전해져 오고 있다.</em></p>

변박자

<p>5(2+3)박, 7(2+2+3, 3+4 등) 박 등 <span style="font-weight: bold;">단순박(2, 3, 4박)과 복합박(6, 9, 12박)</span>을 합산하여 조합한 박자를 말한다. 또한 <span style="color: red;">속된 말로 박자가 자주 바뀌는 것.</span></p>

변속

<p><span style="font-weight: bold;">BPM이 약 2배 이상 상승하거나 하강하는 것.</span> BPM을 두 배로 늘려 스크롤 속도를 높이는 기법의 원조라 할 수 있는 <span style="color: blue;">'beatmaniaIIDX 2nd style'</span>의 <span style="text-decoration: underline;">'SOFT LANDING ON THE BODY'</span>라는 곡에서 유래했다. <span style="font-style: italic;">좁은 의미로는 어원이 된 'SOFT LANDING ON THE BODY'와 같이 곡조와 관계없이 BPM이 2배로 변동하는 것을 의미했지만, 점차 확대 해석되어 현재는 다음과 같이 사용자와 대화 내용에 따라 뉘앙스가 달라지고 있다.</span> <span style="background-color: yellow;">정확한 정의는 없지만 속도 변화를 가리키는 것은 확실해 보인다.</span></p>

복합

<p><span style="font-weight: bold;">동과 캇이 뒤섞인 채보를 말한다.</span> 주로 12분에서 16분 이상의 밀도를 가진 것을 말한다. 원래는 섞여 있는 모든 것을 가리키는 말이지만, 현재 태고의달인에서는 아래 세 가지 의미로 쓰이는 경우가 많다.</p>
<ol>
<li><span style="font-style: italic;">やわらか戦車(뒷보면)</span>이나 <span style="font-style: italic;">旋風ノ舞【天】</span>처럼 단순하지만 긴 것을 가리키는 경우</li>
<li><span style="font-style: italic;">燎原ノ舞</span>, <span style="font-style: italic;">星屑ストラック(뒷보면)</span>처럼 혼합하는 방법이 복잡한 경우</li>
<li><span style="font-style: italic;">IN THE ZONE</span>이나 <span style="font-style: italic;">Wings of Tomorrow（Tatsujin Mix）</span>와 같이 16비트와 24비트가 섞여 있는 것을 가리키는 경우</li>
</ol>

부모 서포트

<p><span style="font-weight: bold;">1인 플레이 중, 참가하지 않은 북도 연주에 참여할 수 있도록 설정된 채보.</span> 첫 구현은 <span style="color: red;">AC11</span>. 이름처럼 부모와 자녀가 함께 즐길 수 있기 때문인지 어린이(구 동요)의 노래에 많이 등장한다.</p>
<p>난이도는 '<span style="font-style: italic;">쉬움</span>'만 지원되고 대상 곡은 곡 선택 화면, 난이도 선택 화면에서 '<span style="font-weight: bold;">아빠 엄마 지원 대응</span>' 아이콘이 표시된다.</p>

북채

<p><strong>북을 칠 때 사용하는 도구.</strong> 한자로는 <span style="color: blue;">枹</span>, 영어로는 <span style="color: green;">drum stick</span>. 당연한거지만 북의 측면(몸통 부분)이나 북 이외의 것(모니터, 기체 하단부 등)을 두드리는 것은 기체 고장의 원인이 되므로 <span style="font-style: italic;">절대로 해서는 안 된다.</span></p>
<p>또한 북채를 부주의하게 휘두르거나 던지는 등 본래의 용도를 벗어난 용도로 사용하면 <span style="text-decoration: underline;">다른 사람을 다치게 하거나 주변 물건을 망가뜨릴 수 있어 매우 위험하다.</span></p>

분업

<p><strong>오른손으로 면, 왼손으로 테두리 등으로 구분하여 치는 방법.</strong></p>

불량기체

<p>간접이나 무반응이 심한 기체를 말한다. 구작에서는 이 부분이 심할 경우, <strong>플레이 도중 오류가 발생해 타이틀 화면으로 되돌아가는 감지 기능도 있다.</strong> 놀이공원의 게임 코너 등은 기본적으로 방치되어 있고, <em>어린이 동반이 많은 게임센터는 어린아이들이 난폭하게 두드리는 경우가 많아 모두 불량기체일 가능성이 높다.</em></p>

불렙

<p><strong>공식이 지정한 난이도보다 어렵게 느껴지는 곡을 말한다.</strong> 어떤 라인이 불렙인지 물렙인지에 대한 판단 기준은 사람마다 다르며, 난이도가 높아질수록 그 편차도 커진다. <em>정확한 난이도 서열에 대해서는 찬반 양론이 오가는 논쟁이 매일 벌어지고 있다.</em> 다만, 이런 주제는 열기가 뜨거워지고 험악해지기 쉽기 때문에 토론의 장이 아닌 곳에서는 불렙, 물렙 등의 난이도 비교를 하는 것은 바람직하지 않다고 알려져 있다.</p>

비인기곡

<p>수록은 되어 있지만, 특히 연주되는 횟수가 극히 적은, <em>연주되는 모습을 잘 볼 수 없는 곡을 말한다.</em></p>

빔

<p><strong>빠른 처리를 요하는 순간적인 광기를 의미하며,</strong> 16분노트의 복합에는 이 용어가 사용되지 않는다. <em>燎原ノ舞의 25마디 중 24비트, Hurtling Boys의 55~56마디 기차</em>(통칭 <span class="highlight">'에토우빔'</span>) 등에서 자주 사용된다.</p>

사요나라

<p><strong>삭제곡의 태고의 달인에서의 공식 명칭.</strong> 전 태고팀 타카하시가 <em>'태고의 달인 11'</em>에서 삭제곡을 소개한 기사가 현재 확인할 수 있는 가장 오래된 사용 사례다.</p>
<p>삭제곡이 발생하는 이유는 명확하게 밝혀지지 않았지만 <span class="highlight">판권곡의 계약기간 만료, 적은 플레이, 데이터 마이그레이션에 따른 일시적 삭제</span> 등 주로 다음과 같은 이유를 생각해 볼 수 있다.</p>

서열표

<p><strong>리듬 게임의 난이도 체계에서 같은 레벨이라도 상위권과 하위권의 격차</strong>는 존재하기 때문에 해당 레벨대를 도는 사람들이 참고할 수 있도록 만든 <em>특정 레벨 내의 난이도 비교표</em>.</p>

<p>서열표 작성 기준은 해당 게임의 주 메타가 무엇이냐에 따라 달라지지만, <span class="highlight">클리어 기준 서열표는 대부분의 리듬게임에 존재</span>하며, 그 외 <span class="highlight">풀콤, 전량이 주 목표가 되는 게임은 풀콤, 퍼펙트 난이도 서열표가 만들어지기도 한다.</span></p>

<p>이외에도 <em>데타라메 풀콤 서열표</em> 등 다양한 유형의 서열표가 존재한다.</p>

스크롤

<p><strong>High Speed(고속)</strong>의 약자로, <em>스크롤 속도의 배율</em>이라는 뜻이다. <span class="highlight">배속</span> 이라고 부르기도 한다.</p>

<p>타 리듬 게임에서는 플레이어가 자신에게 적합한 스크롤 속도로 바꾸는 것으로 사용되며, <span class="highlight">태고의 달인과는 전혀 다른 개념</span>이다.</p>

쌍타, DP

<p>2014년 8월 28일 태고팀 생방송 및 설문조사를 통해 <em>双打(쌍타)</em>라는 명칭이 결정되었다. 일반적으로 <span class="highlight">더블플레이(DP)</span>라고 부르는 경우가 많다.</p>

<p>한 사람이 두 개의 북을 동시에 연주하는 것을 말한다. 난이도 편의상 <span class="highlight">후츠으 코스나 무즈카시이 코스</span>에서 플레이하는 경우가 많으며, <span class="highlight">오니 코스</span>는 저밀도의 곡으로 제한된다.</p>

어레인지

<p>원래 노트가 놓여있지 않은 부분을 치는 것(<strong>공타</strong>)을 말한다. <em>역수법</em>을 사용하는 복합을 오른손으로 칠 수 있도록 하거나, 정확도를 높이기 위해 2타의 음을 3타로 치는 등 그 <span class="highlight">쓰임새가 다양</span>해 기억해두면 도움이 되는 기법이다.</p>

<p>또한 노트가 없는 쉬는 구간을 멋지게 치거나, 처음부터 끝까지 12~16비트 간격으로 채보를 계속 치는 <span class="highlight">논스톱 어레인지</span> 등 다양한 방법으로 연주할 수 있다.</p>

역보더

<p>게임 내에서 역보더의 경우들은 다음과 같다:</p>
<ul>
<li>클리어를 목표 중 <strong>게이지 부족</strong></li>
<li>전량(전체 노트 정확도)을 목표 중 <strong>1가</strong></li>
<li>풀콤보를 목표 중 <strong>1불가</strong></li>
</ul>

연속 코인 넣기

<p>플레이 종료 후 다시 동전을 넣어 연속으로 플레이하는 행위를 말한다. <strong>기다리는 사람이 있을 때 이런 행동을 하는 것은 말할 필요도 없이 매너 위반이다.</strong></p>
<ul>
<li>플레이가 끝나면 주변을 한 번 둘러보고, 기다리는 사람이 있으면 교대한다.</li>
<li>1코인 투입으로 2코인 이상 들어가는 설정의 경우, <strong>1코인 분량의 크레딧을 모두 사용한 후 교체하는 것이 바람직하다.</strong></li>
</ul>

연타곡

<p>채보에 <strong>연타 노트가 극단적으로 많은 곡</strong>을 말한다. 정확도 곡과 달리 연타에 따라 점수가 좌우되기 때문에 단순히 연타를 중시하는 플레이어가 유리하다.</p>
<ul>
<li>그러나 신기체에서는 연타 점수가 300점에서 100점(대노트 연타는 360점에서 200점)으로 줄어들었기 때문에 연타로 낮은 정확도를 속이는 것이 어려워졌다.</li>
<li>또한, <strong>노란색 연타나 지정된 타수를 이론적으로 칠 수 없는 풍선 연타</strong> 등이 하나라도 있는 곡은 정확도 곡과 구별하기 위해 연타곡이라고 부르기도 한다.</li>
</ul>

완전정밀곡

<p><strong>풍선이나 롱노트가 전혀 없는</strong> 정밀곡, 정밀채보를 말한다.</p>

우라, 뒷보면

<p>AC11부터 특정 곡에 덤으로 원래의 <u>채보</u>(<strong>이하 표채보</strong>)와 다른 별도의 채보가 제공되기 시작했다. 처음에는 이를 어떻게 불러야 할지 다소 혼란스러웠지만, 현재는 공식적으로 <strong>'뒷보면'</strong>으로 불리고 있다. 신기판부터 난이도 선택 시 <strong>'오니'</strong>를 선택한 상태에서 오른쪽 가장자리를 10번 두드리면 <strong>우라 채보</strong>가 나온다.</p>

유사32비트

<p><strong>4분노트를 8분의 1로 나눈 노트의 길이.</strong></p>
<ol>
<li><strong>BPM 배속 타입:</strong> BPM을 2배, HS를 0.5배로 하여 내부 16분 노트를 겉으로 보이는 32분 노트로 만드는 유형.</li>
<li><strong>1.5/48박자 유형:</strong> '32비트는 놓을 수 없지만, 1마디의 길이를 32비트 길이로 만들 수 있고, 그 마디의 처음에 노트를 놓을 수 있다'는 사양을 이용한 타입이다.</li>
<li><strong>24비트에 HS0.75배로 겉보기 32비트로 만든 곡도 있다:</strong> 예: テルミン狂想曲</li>
</ol>

이론치

<p><strong>두 가지 의미가 존재하기 때문에 각각 따로 표기한다.</strong></p>
<ol>
<li><strong>천장 점수의 의미 1:</strong> 특별한 언급이 없는 한 '해당 채보에서 획득할 수 있는 점수의 상한선'을 의미한다. <em>천장 점수에 노란색 연타를 프로그램의 처리 한계까지 치고 나갔을 때의 점수를 더한 것이다.</em> 처리 속도는 일정하지 않기 때문에 이론상 수치에도 차이가 있을 수 있지만, 노란색 연타의 속도는 통상 60fps의 각 프레임마다 모두 연타를 치는 것으로 가정하고 60타/초로 계산한다.</li>
<li><strong>천장 점수의 의미 2:</strong> 단위 도장에서 이 용어가 나오면 '그 사람이 이론적으로 달성할 수 있는 최고 성적'을 의미한다. <u>예를 들어, 소라이로 10단의 과제곡에서 각각 정확도에 관한 자기 최고점이 'Doom Noiz에서 량900, 가60, 불가1', '요원의 춤에서 량800, 가20, 불가2', '성불2000에서 양900, 가90, 불가9'라면, 3곡의 이론값은 '良2600, 可170, 不可12'가 된다.</u> 실제 소라이로 10단의 적색 합격 조건은 가30 미만, 불합격 10 미만이기 때문에 이 사람이 소라이로 10단을 받았다고 해도 합격할 수 없다고 볼 수 있다.</li>
</ol>

이복역단타법

<p><strong>복합타법의 종류:</strong> 복합은 버나스와 같이 <em>모두 오른손으로 치는 복합타법</em>이지만, 그 외에는 <u>역수로만 치는 복합타법</u>이며, 후자도 오른손으로 치는 것이 버나스이다. 예를 들어 오른손잡이의 경우 ●●●　●　●　●　●●●을 우좌우 좌 좌 좌 우좌우로 두드리는 것이다.</p>

<p><strong>장점:</strong> 주로 오른손만 사용하는 버나스보다 피곤하지 않고, 좌우 교대보다 쉽게 할 수 있으며, 단음 후 복합이 오른손부터 들어가기 쉽다는 장점이 있습니다.</p>

<p><strong>단점:</strong> 짝수 연타 후 단음의 적용이 어렵고, BPM이 빠른 곡이나 복합이 많은 곡에 적용하기 어렵다는 단점도 있다.</p>

이펙트 버그

<p><strong>일반적인 표현:</strong> 면을 치면 판정틀 주변에 <em>빨간색 효과</em> 및 판정틀에 노트의 크기에 따른 <u>동짱의 얼굴</u>이, 테두리를 치면 판정틀 주변에 <em>하늘색 효과</em> 및 판정틀에 노트의 크기에 따른 <u>캇짱의 얼굴</u>이 표시된다.</p>

<p><strong>예외 현상:</strong> 이러한 효과나 얼굴이 표시되지 않는 현상을 말한다. <em>신기판 화이트 버전</em>에서도 일시적으로 비슷한 현상이 발생했던 적이 있었다.</p>

<p><strong>수정:</strong> 이는 업데이트를 통해 수정되었다.</p>


인단위

<p><strong>단위 도장의 등급:</strong> <em>현인, 명인, 초인, 달인</em>을 지칭하는 단어입니다. <u>달인은 모모이로 버전에서, 현인~초인은 무라사키 버전에서 추가되었다.</u></p>

<p><strong>실력 요구:</strong> 9단에 비해 조건이 훨씬 까다로워진 10단 이상의 단위에 걸맞게 과제곡은 모두 ★×10으로 높은 실력이 요구된다.</p>

<p><strong>공략 요소:</strong> 압도적인 처리력과 집중력, 다양한 곡을 능숙하게 다룰 수 있는 실력과 연구가 필수적이다.</p>

<p><strong>인단이라는 칭호:</strong> 탑랭커의 증표다.</p>


입리겜

<p><strong>유튜브, 커뮤니티에서의 난이도 평가:</strong> 실제로 플레이 해보지도 않거나, 자신이 단순히 어렵거나 쉽다는 이유로 패턴의 난이도를 평가하는 것을 말한다.</p>

<p><strong>소동과 겜안분:</strong> 이러한 행동이 소동을 일으키면 <em>겜안분</em>(게임 안 하는 분탕)이라고도 부르기도 한다.</p>


저작권 곡

<p><strong>저작권 곡의 정의:</strong> 반다이남코 이외의 작품의 곡이 해당되지만, '반다이남코 엔터테인먼트가 배포권 등 게임에 수록할 수 있는 권리를 완전히 관리하지 않는 곡'은 저작권 곡으로 분류된다.</p>

<p><strong>저작권 곡의 특성:</strong> 이러한 곡들은 저작권자의 이유로 작별을 고하기 쉽다. 신기체에서는 온라인으로 전국의 선곡 경향을 집계할 수 있게 되었기 때문에, 장기적으로 선곡률이 높은 곡에 대해서는 당초의 수록 기간을 연장하여 계속 수록될 수도 있다.</p>

<p><strong>삭제 조건:</strong> 단, 이 경우에도 선곡률이 낮아지면 연장 시 결정한 기간이 지나면 삭제된다.</p>

전가
<p>단 한 번도 <strong>량, 불가를 내지 않고</strong>, 모든 노트를 <em>가 판정</em>으로 치는 것. 공식적으로는 '<u>꼬임풀콤보</u>'라고 부른다. (포터블 DX의 공략집, 3DS1의 스탬프북 등에서 유래) 아케이드의 칭호에는 등장하지 않는다. 모든 노트의 타이밍을 량과 불가를 나오지 않도록 <strong>엇갈리게 쳐야 하는데</strong>, 일반적으로 <em>전량보다 더 어렵다고 알려져 있다</em>. 오니 코스의 대부분의 채보에서는 이것을 달성하면 <u>클리어할 수 없다</u>.</p>


전도
<p>다른 플레이어와 세션을 통해 <strong>칭호나 곡 등을 획득</strong>할 수 있는 시스템. 전도 해금 곡은 신AC 그린 Ver.까지 <em>万戈イム－一ノ十과 幽玄ノ乱</em>의 2곡이다. 단, 태고의 달인에서 전도 자체는 '<u>오니코스 해금</u>'이 처음인 것으로 보인다. 과거 아시아판은 이 곡을 해금하려면 일본 나가사키의 하우스 텐 보스에서 열렸던 태고 이벤트에 있는 <strong>카드 리더기에 카드를 찍어야 해금할 수 있었다</strong>. 다행히 국내 유저 중 한 명이 곡을 가져왔었다<</p>

전량
<p>단 한 번도 <strong>가, 불가를 내지 않고</strong>, 모든 노트를 <em>량 판정</em>으로 치는 것. 현재 공식적으로는 '<u>동더풀콤보</u>'라고 불린다. (포터블 DX의 연습장 및 공식 블로그 등에서) 니지이로Ver.에서 전량 달성 시 <strong>전용 왕관인 '동더풀콤보 왕관(무지개 왕관)'</strong>이 등장했다. 참고로 이 왕관은 그린 버전까지 전량을 달성한 채보에 대해, 동더풀콤보 구현 전 모모이로 버전 이전까지만 전량을 달성한 채보(<em>동더풀콤보 횟수에 반영되지 않은 곡</em>)를 포함한 모든 채보에 증정되었다. 이 경우, 개인이 확인할 수 있는 <u>동더풀콤보 횟수는 0회이다</u>.</p>

정배
<p>옵션 중 <strong>'아베코베', '키마구레', '데타라메'</strong>를 사용하지 않은, <em>기본 상태의 채보</em>를 말한다. 단순히 '<u>정규</u>'라고도 한다.</p>

정전기
<p><strong>정전기로 인해 북을 치지 않았는데도 북이 반응하거나 다발이 생기는 현상</strong>. 주로 겨울철에 많다. 면 바깥쪽에서 발생한 정전기가 안쪽에 있는 철물에 닿아 <em>센서의 오반응을 유발하고 있다</em>. 니지이로Ver.이 된 후 <u>연주 스킵이 추가되어 이전보다 오반응을 더 쉽게 느낄 수 있게 되었다</u>. 라고 쓰였지만 실제로는 자세한 검증이 이루어지지 않아 <em>정전기와 오반응의 인과관계는 알 수 없다</em>. 정전기라면 미리 철물을 통해 방전시켜서 발생을 방지할 수 있다.</p>

첫플
<p>말 그대로 그 곡을 <strong>처음 플레이하는 것</strong>. <em>초견과 혼동하기 쉬우므로 주의</em>.</p>


초견
<p>말 그대로 <strong>초견(初見)으로 플레이하는 것</strong>. <em>첫 플레이와 혼동하기 쉬우니 주의</em>. '<u>처음 본다</u>'이므로 좁은 의미로는 그 곡의 채보에 대한 정보를 가지고 있지 않은 상태에서 연주하는 것을 말한다. 별의 개수를 조사한 후 플레이하거나 음원을 듣고 채보를 예상한 후 플레이하는 정도라면 포함되지만, <strong>채보 페이지나 동영상으로 채보를 확인한 후 플레이하는 것은 포함되지 않는다</strong>. 들어본 적도 없는 곡을 초견 플레이하는 것을 '<em>완전 초견 플레이</em>'라고 부르기도 한다.</p>

초견살
<p><strong>적정 레벨이라도 채보를 외우지 않으면 클리어하기 어려운 채보 배치가 있는 것</strong>. 처음 본다고 해도 처음 보는 것 외에 <em>'채보를 기억하지 못하는 상태'</em>라는 뜻으로 쓰이는 경우가 많고, 죽인다고 해도 노멀이 떨어지는 것 외에 <u>'콤보가 끊어지는 것'</u> 정도로 쓰이는 경우가 많다.</p>

최종보스곡
<p><strong>AC 작품에 처음 등장한 곡 중 많은 플레이어가 가장 어렵다고 느끼는 곡</strong>, 또는 AC14까지 난이도 순으로 정렬했을 때 <em>가장 오른쪽에 있는 곡</em>을 말한다. 단, <u>난이도 순서는 불완전한 경우가 있다</u>.</p>

콤보 커터
<p><strong>콤보 유지를 방해하는 어려운 배치나 변속</strong> 등을 가리킨다.</p>

타타콘
<p><strong>가정용 콘솔 게임기 시리즈에 사용되는 태고 모양을 본뜬 컨트롤러</strong>. '<em>타타콘</em>'이라는 이름이 공식적으로 사용된 것은 PS2 시리즈까지이며, Wii 시리즈부터는 '태고과 북채'로 명칭이 변경됐지만, <u>동더들은 애칭으로 '타타콘'이라고 부르는 경우가 대부분이다</u>. 이 컨트롤러를 사용하면 집에 있으면서 아케이드로 북을 치는 듯한 기분을 느낄 수 있다.</p>

태고 팀
<p><strong>'태고의 달인' 시리즈 제작진의 통칭</strong>. 2017년 11월 30일을 기점으로 <em>블로그 업데이트 주기가 매주 목요일→비정기적으로 바뀌었고</em>, 2009년 11월 등록 이후 8년간 사용하던 트위터 계정명이 '태고 팀'에서 '태고의 달인'으로 바뀌었고, <u>2020년 10월 30일에 스마트폰 버전, 2021년 2월 20일에 종합 및 가정용 공식 트위터 계정이 추가되었다</u>. 현재 '게임센터 버전'이 기존 종합 공식 계정이다.</p>

트릭
<p>주로 <strong>채보의 배치가 정직하지 않기 때문에 틀리기 쉬운 것</strong>. '<em>저주에 걸렸다</em>'라고도 한다.</p>

판 버리기
<p><strong>연주 도중에 연주를 포기하거나 설정된 곡을 몇 분 동안 연주하지 않고 방치하는 행위</strong>. 전자는 급한 용무로 인해 대를 이탈하는 경우도 있지만, 대개는 <em>고득점 갱신에 대한 전망이 보이지 않거나, 가나 불합격 등으로 인한 배신감, 단위 도장에서 불합격이 확정된 경우나 합격/금합격이 절망적인 상황으로 전개되는 경우가 많다</em>. 니지이로Ver.에서는 새로운 연주 옵션 '<u>연주 스킵</u>'이 추가되었는데, 1인 플레이 시에만 사용할 수 있는 옵션으로, 사용하지 않는 북의 가장자리를 좌우로 번갈아 10번 치면 연주가 중단된다. 연속으로 플레이할 때, 기록 갱신이 안 되거나 전량을 놓쳤을 때 사용하면 좋을 것이다.</p>

평오오
<p>주로 <strong>아케이드 리듬게임 유저들이 사용하는 용어</strong>. 평일 오전(혹은 오후) 오락의 줄임말로, 평일 오전 혹은 오후는 일반적인 학생 혹은 직장인들이 쉽게 게임을 할 수 없는 시간대인지라 이 시간대에 게임을 하는 유저들에 대한 <em>선망 혹은 질투를 담은 용어이다</em>. 그래서 관련된 <u>합성짤방도 많이 만들어졌다</u>.</p>

폭발
<p><strong>면을 두드리면 가장자리가 반응하거나, 오른쪽 가장자리를 두드리면 왼쪽 가장자리가 반응하는 등 두드리지 않은 부분이 반응하는 현상</strong>. 왼쪽 가장자리의 폭발이 심할 경우, <em>오니, 뒷 채보를 내는 것이 어려워진다</em>. 가장자리를 치면 면이 반응하는 경우, <u>곡, 옵션, 난이도 선택이 어려워진다</u>.</p>

하네리듬
<p>
<strong>8비트의 타이밍을 일부 엇갈리게 하여 부점노트나 3・6연음(12비트 또는 24비트)처럼 마치 튀어 오르는 듯한 리듬</strong>을 말한다.
<strong>리듬 게임</strong>에서 많이 사용된다.
<em>태고의 달인</em>에서는 빠른 BPM에 12비트 2타 배치가 많은 <u>채보</u>를 가리키는 경우가 많다.
12비트 2타의 연속은 8비트의 <strong>셔플</strong>의 연속이기도 하다.
</p>


해금
<p>
<strong>일반적으로 플레이 할 수 없는 곡을 플레이 가능하게 만드는 행위 또는 잠긴 아이템을 획득하는 것</strong>.
아이템, 곡에 따라 <em>특정 기간에 열리는 경우도 있고</em>, 게임 플레이를 통해 포인트를 모아서 <u>포인트로 구매하는 경우도 있다</u>.
</p>

허공 치기
<p>
<strong>동전을 넣지 않고 북을 두드리는 것</strong>.
다른 사람의 연주에 맞춰 <em>사용하지 않는 쪽의 북을 두드리는 것도 이에 해당한다</em>.
</p>
후살
<p>
마지막에 <strong>콤보 커터나 발광이 있는 것을 말한다</strong>.
</p>

11호
<p>
<strong>2018년 5월 18일 공식 블로그에 첫 등장</strong>. 블로그에서는 <em>공지사항을 담당하고 있다</em>.
<u>게임센터판 프로듀서이며</u>, 평소에는 이벤트 준비나 콜라보레이션 상담 등에 관여하고 있다.
블로그 업데이트 담당을 맡게 된 정확한 날짜는 <em>불명</em>.
11호라는 이름의 유래는 <u>키미즈 P의 K가 알파벳의 11번째이기 때문이다</u>.
</p>

300족
<p>
<strong>기본 BPM이 300인 곡을 말한다</strong>.
초고난이도 곡 대부분이 300이라는 <em>고BPM으로 HS1에서 8분노트와 16분노트, 채보에 따라서는 12분노트가 대량으로 나오는 초고속 물량 채보이다</em>.
또한, 두 채보(神竜 ～Shinryu～은 뒷부분 채보) 모두 <u>달인 3번째 곡으로 많은 달인 도전자들을 괴롭혀왔다</u>.
poxei◆DOON을 제외한 300족의 달인 3곡은 <em>평균 밀도가 10타/초를 넘는다</em>.
현재 평균 밀도가 10타/초를 넘는 채보는 5곡이 존재하는데, 그 중 <u>4곡이 300족이다</u>.
</p>

AC
<p>
<strong>Arcade Computer(아케이드 컴퓨터)의 약자</strong>. 이른바 아케이드판(업무용) <em>'태고의 달인'</em>을 가리킨다.
<u>기판은 AC판 태고의 달인 본체를 말한다</u>.
</p>

BPM
<p>
<strong>BPM은 'Beats Per Minute'이고 우리말로 하면 '분당 박자 수'이다</strong>.
박자'는 <em>태고의 달인에서 4분노트 1개를 '한 박자'로 취급한다</em>.
음악의 세계에서는 채보의 <u>'○분의 ○박자'에 따라 1박자에 해당하는 노트가 바뀐다</u>.
원래는 'xxx BPM'이라고 표현하는 것이 옳고 'BPMxxx'라고 표현하는 것은 <em>잘못된 표현이지만</em>, 후자의 용법이 널리 퍼져 있기 때문에 특별히 지적되는 일은 없다.
</p>

CS
<p>
<strong>Consumer Software(컨슈머 소프트웨어)의 약자</strong>. 이른바 <em>가정용 게임기용 게임기 버전을 말한다</em>.
휴대용(DS, switch 등)이나 스마트폰용(iOS, 안드로이드)도 <u>여기에 포함된다</u>.
</p>

NN
<p>
<strong>노 클리어 노 미스(No clear No miss)의 약자</strong>. 영어로는 <em>FF(Full Fail)라고도 한다</em>.
풀 콤보는 했지만, '좋음' 판정이 많아서 <u>소울 게이지가 클리어에 도달하지 못하는 현상</u>.
좋음' 판정이 포함되어도 발생하지만, <em>난이도가 높다</em>.
</p>

n분노트

<p>
<strong>한 마디(4/4박자)를 n분할했을 때 간격으로 늘어선 노트들을 말한다</strong>.
이 게임에서는 노트가 조금 겹치는 것은 대부분 <em>16분노트라고 생각해도 무방하다</em>.
일반적인 채보에는 <u>12분노트, 24분노트가 존재하지 않지만 편의상 사용하고 있다</u>.
일반적인 채보에서의 표기는 12분노트는 '4분노트 3연노트', 24분노트는 '8분노트 3연노트, 4분노트 6연노트'를 사용한다.
하지만 12분노트 등의 표현은 <em>알기 쉽고, 다른 의미로 오해할 염려가 없기 때문에 음악 게임에서는 자주 사용된다</em>.
</p>`;

let arr = text.split('\n').filter(e => e !== '');
arr.forEach(function(e, i, a){
    if(!(/^\</.test(e))){
        a[i] = '\n';
    }
    else{
        a[i] = e.replace(/\\n/g, '');
    }
})

let output = arr.join('');

console.log(output);